Catalogs/ТК_УчетныеЗаписиEDI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ТК_УчетныеЗаписиEDI</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПоставщикEDI</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПоставщикиEDI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПассивныйРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоединениеССервером</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователяНаСервере</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПользователяНаСервере</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортСервера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогЗагрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШифрованиеSSL</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаВНРег</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоЗагрузка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодразделениеКомпании</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ТК_УчетныеЗаписиEDI/Ext/ManagerModule.bsl
Функция ПолучитьПараметрыПодключения(УчЗапись,Выгружать = Истина) Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",УчЗапись);
	Запрос.УстановитьПараметр("Выгружать",Выгружать);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТК_УчетныеЗаписиEDI.СоединениеССервером КАК ИмяСервераFTP,
		|	ТК_УчетныеЗаписиEDI.ИмяПользователяНаСервере КАК ИмяПользователяFTP,
		|	ТК_УчетныеЗаписиEDI.ПарольПользователяНаСервере КАК ПарольFTP,
		|	ТК_УчетныеЗаписиEDI.ПортСервера КАК ПортFTP,
		|	ВЫБОР
		|		КОГДА &Выгружать
		|			ТОГДА ТК_УчетныеЗаписиEDI.КаталогВыгрузки
		|		ИНАЧЕ ТК_УчетныеЗаписиEDI.КаталогЗагрузки
		|	КОНЕЦ КАК ТекущийКаталогFTP,
		|	ТК_УчетныеЗаписиEDI.ШифрованиеSSL КАК ИспользоватьSSL,
		|	ТК_УчетныеЗаписиEDI.ПассивныйРежим КАК ПассивныйРежим,
		|	ТК_УчетныеЗаписиEDI.ПоставщикEDI КАК ПоставщикEDI,
		|	ТК_УчетныеЗаписиEDI.ИмяФайлаВНРег КАК ИмяФайлаВНРег
		|ИЗ
		|	Справочник.ТК_УчетныеЗаписиEDI КАК ТК_УчетныеЗаписиEDI
		|ГДЕ
		|	ТК_УчетныеЗаписиEDI.Ссылка = &Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыFTP = Новый Структура("ПоставщикEDI,ИмяСервераFTP,ИмяПользователяFTP,ПарольFTP,ПортFTP,ТекущийКаталогFTP,ИспользоватьSSL,ПассивныйРежим,КаталогНахожденияФайла,ИмяФайлаСообщения,Удалять,ИмяФайлаВНРег");
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий(); 	
	ЗаполнитьЗначенияСвойств(ПараметрыFTP,ВыборкаДетальныеЗаписи);
	
	Возврат ПараметрыFTP;
		
	
КонецФункции


Функция ПолучитьМассивУчетныхЗаписейEDI(Выгружать = Истина)Экспорт
	
	Массив = Новый  Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТК_УчетныеЗаписиEDI.Ссылка КАК Ссылка,
	|	НЕОПРЕДЕЛЕНО КАК Подразделение
	|ИЗ
	|	Справочник.ТК_УчетныеЗаписиEDI КАК ТК_УчетныеЗаписиEDI
	|ГДЕ
	|	ТК_УчетныеЗаписиEDI.ПометкаУдаления = ЛОЖЬ
	|	И ТК_УчетныеЗаписиEDI.Отключен = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТК_УчетныеЗаписиEDIПодразделения.Ссылка,
	|	ТК_УчетныеЗаписиEDIПодразделения.ПодразделениеКомпании
	|ИЗ
	|	Справочник.ТК_УчетныеЗаписиEDI.Подразделения КАК ТК_УчетныеЗаписиEDIПодразделения
	|ГДЕ
	|	ТК_УчетныеЗаписиEDIПодразделения.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ТК_УчетныеЗаписиEDIПодразделения.Ссылка.Отключен = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ПараметрыУчЗаписи = ПолучитьПараметрыПодключения(ВыборкаДетальныеЗаписи.Ссылка,Выгружать);
		
		Массив.Добавить(Новый Структура("Учетка,Подразделение,Параметры",ВыборкаДетальныеЗаписи.Ссылка,ВыборкаДетальныеЗаписи.Подразделение,ПараметрыУчЗаписи));
		
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции
